Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Set the time zone of the output to `<zone name>`.
ja_jp: 出力のタイムゾーンを `<zone name>` に設定します。

source: Set the traces exporter to `logging`. Normally you don't need to set this. The default is `cdi`.
ja_jp: トレースエクスポーターを `logging` に設定します。通常、これを設定する必要はありません。デフォルトは `cdi` です。

source: Set the value associated with the given key
ja_jp: 与えられたキーに関連する値を設定します

source: Set this config to `false` if you are also using the `quarkus-jacoco` extension and have at least one `@QuarkusTest`. The default `jacocoTestReport` task can be skipped since `quarkus-jacoco` will generate the combined report of regular unit tests and `@QuarkusTest` classes since the execution data is recorded in the same file.
ja_jp: `quarkus-jacoco` エクステンションも使用していて、少なくとも 1 つの `@QuarkusTest` がある場合は、この設定を `false` にします。デフォルトの `jacocoTestReport` タスクは省略できます。なぜなら、通常のユニットテストと `@QuarkusTest` クラスの実行データが同じファイルに記録されているため、 `quarkus-jacoco` がそれらを合わせたレポートを生成するからです。

source: Set this property if another header such as `Cookie` is used to pass the token.
ja_jp: `Cookie` などの別のヘッダーを使用してトークンを渡す場合は、このプロパティーを設定します。

source: Set this property if another header such as `Cookie` is used to pass the token. This property is deprecated - use 'mp.jwt.token.header'.
ja_jp: `Cookie` などの別のヘッダーを使用してトークンを渡す場合は、このプロパティーを設定します。このプロパティーは推奨されていません。'mp.jwt.token.header' を使用してください。

source: Set this property if another header, such as `Cookie`, is used to pass the token.
ja_jp: `Cookie` などの別のヘッダーを使用してトークンを渡す場合は、このプロパティーを設定します。

source: Set this property if another header, such as `Cookie`, is used to pass the token. This property is deprecated - use 'mp.jwt.token.header'.
ja_jp: `Cookie` などの別のヘッダーを使用してトークンを渡す場合は、このプロパティーを設定します。このプロパティーは推奨されていません。'mp.jwt.token.header' を使用してください。

source: Set this property to `false` to disable an automatic addition of the `iat` (issued at), `exp` (expiration time) and `jti` (token identifier) claims when such claims have not already been set.
ja_jp: このプロパティを `false` に設定すると、これらのクレームが既に設定されていない場合に、`iat`（発行日時）、`exp`（有効期限）、`jti`（トークン識別子）のクレームが自動的に追加されないようになります。

source: Set this property to `true` for `Authorization` header be checked even if the `smallrye.jwt.token.header` is set to `Cookie` but no cookie with a `smallrye.jwt.token.cookie` name exists.
ja_jp: `smallrye.jwt.token.header` が `Cookie` に設定されていても、名前が `smallrye.jwt.token.cookie` の Cookie が存在しない場合、 `Authorization` ヘッダーがチェックされるようにこのプロパティーを `true` に設定します。

source: Set this property to `true` for `smallrye.jwt.new-token.issuer` and `smallrye.jwt.new-token.audience` values to override the already initialized `iss` (issuer) and `aud` (audience) claims.
ja_jp: 既に初期化されている `iss` （発行者）と `aud` （視聴者）のクレームを `smallrye.jwt.new-token.issuer` と `smallrye.jwt.new-token.audience` の値で上書きするために、 このプロパティを `true` に設定します。

source: Set this property to `true` for the `Authorization` header to be checked even if the `smallrye.jwt.token.header` is set to `Cookie` but no cookie with a `smallrye.jwt.token.cookie` name exists.
ja_jp: `smallrye.jwt.token.header` が `Cookie` に設定されていても、名前が `smallrye.jwt.token.cookie` の Cookie が存在しない場合、 `Authorization` ヘッダーがチェックされるようにこのプロパティーを `true` に設定します。

source: Set this property to a specific key format such as `PEM_KEY`, `PEM_CERTIFICATE`, `JWK` or `JWK_BASE64URL` to optimize the way the verification key is loaded.
ja_jp: このプロパティーを `PEM_KEY`、 `PEM_CERTIFICATE`、 `JWK`、 `JWK_BASE64URL` などの特定のキー鍵形式に設定して、検証鍵のロード方法を最適化します。

source: Set this property to true to resolve the remote keys at the application startup.
ja_jp: アプリケーションの起動時にリモート鍵を解決するには、このプロパティーを true に設定します。

source: Set this to a value relative to the project's build directory (i.e. `target` for Maven, `build` for Gradle)
ja_jp: これをプロジェクトのビルドディレクトリーを基準とした相対値に設定します (Maven の場合は `target`、Gradle の場合は `build`)。

source: Set to `true` to enable generation
ja_jp: 生成を有効にするには `true` に設定します。

source: Set up Basic authentication programmatically
ja_jp: Basic 認証をプログラムで設定する

source: Set up Form-based authentication programmatically
ja_jp: フォームベース認証をプログラムで設定する

source: Set up a sampler that uses a constant sampling strategy.
ja_jp: 定数サンプリングを行うサンプラーを設定します。

source: Set up path-specific authorization programmatically
ja_jp: パス固有の認可をプログラムで設定します

source: Set up the `my-service-tls` TLS configuration, specifically the truststore with the CA certificate. Ensure the path matches the one used in the Kubernetes _Deployment_ configuration. The file is always named `service-ca.crt`.
ja_jp: `my-service-tls` TLS 設定、具体的には CA 証明書を含むトラストストアを設定します。 パスが Kubernetes _Deployment_ 設定で使用されているパスと一致していることを確認します。 ファイルの名前は必ず `service-ca.crt` になります。

source: Set up the keystore with the paths to the certificate and private key. This can be configured by using environment variables or configuration files. This example uses environment variables. OpenShift serving certificates always create the `tls.crt` and `tls.key` files.
ja_jp: 証明書と秘密鍵へのパスを使用してキーストアを設定します。 これは、環境変数または設定ファイルを使用して設定できます。 この例では環境変数を使用します。 OpenShift 提供証明書は必ず `tls.crt` ファイルと `tls.key` ファイルを作成します。

source: Set up the mutual TLS client authentication programmatically
ja_jp: 相互 TLS クライアント認証をプログラムで設定します。

source: Set your application management URL, which you can use to handle ACME challenges. Use `https://localhost:8443/` if you choose not to enable a management router in the <<lets-encrypt-prerequisites,Let's Encrypt prerequisites>> step.
ja_jp: ACME チャレンジの処理に使用できるアプリケーション管理 URL を設定します。 <<lets-encrypt-prerequisites,Let's Encrypt prerequisites>> ステップで管理ルーターを有効にしない場合は、`https://localhost:8443/` を使用します。

source: Set your domain name.
ja_jp: ドメイン名を設定します。

source: Sets Infinispan Server address list, separated with commas
ja_jp: Infinispanサーバーのアドレスリストをカンマ区切りで設定します。

source: Sets Infinispan Server address list, separated with commas. This is the default cluster.
ja_jp: Infinispanサーバーのアドレスリストをカンマ区切りで設定します。これはデフォルトのクラスタです。

source: Sets Infinispan Server address list, separated with semicolons
ja_jp: セミコロンで区切られたInfinispanサーバのアドレスリストを設定します

source: Sets Infinispan Server address list, separated with semicolons. This is the default cluster.
ja_jp: Infinispanサーバのアドレスリストをセミコロンで区切って設定します。これはデフォルトのクラスタです。

source: Sets Infinispan URI connection. The following properties will be ignored: hosts, username and password.
ja_jp: InfinispanのURI接続を設定します。以下のプロパティは無視されます: hosts、username、password。

source: Sets a configuration property for the test.
ja_jp: テストの設定プロパティーを設定します。

source: Sets a message selector. This attribute is used to define an `apache.org:selector-filter:string` filter on the source terminus, using SQL-based syntax to request the server filters which messages are delivered to the receiver (if supported by the server in question). Precise functionality supported and syntax needed can vary depending on the server. Type: _string_
ja_jp: メッセージセレクタを設定する。この属性は、送信元端末に `apache.org:selector-filter:string` フィルタを定義するために使用されます。SQL ベースの構文を使用して、受信者に配信されるメッセージをサーバフィルタに要求します（該当するサーバでサポートされている場合）。サポートされる機能や必要な構文は、サーバーによって異なる場合があります。 Type: _string_

source: Sets how long preflight request results are cached.
ja_jp: プリフライトリクエストの結果をキャッシュする期間を設定します。

source: Sets the SNI host name
ja_jp: SNIホスト名の設定

source: Sets the `iss` (issuer) claim in the JWT. This value must match the server-side `mp.jwt.verify.issuer` configuration for the token to be considered valid.
ja_jp: JWT に `iss` (発行者) クレームを設定します。 トークンが有効と見なされるためには、この値がサーバー側の `mp.jwt.verify.issuer` 設定と一致する必要があります。

source: Sets the authentication password
ja_jp: 認証パスワードを設定

source: Sets the authentication username
ja_jp: 認証ユーザー名を設定

source: Sets the batch size used to load the root entities.
ja_jp: ルートエンティティーをロードするために使用されるバッチサイズの設定。

source: Sets the cache interaction mode for the data loading tasks.
ja_jp: データロードタスクのキャッシュ対話モードの設定。

source: Sets the client intelligence. Use BASIC as a workaround if using Docker for Mac
ja_jp: クライアントのインテリジェンスを設定します。Docker for Macを使用する場合は、BASICをワークアラウンドとして使用します。

source: Sets the client intelligence. Use BASIC as a workaround if using Docker for Mac.
ja_jp: クライアントのインテリジェンスを設定。Docker for Macを使用する場合は、BASICを回避策として使用します。

source: Sets the maximum number of entries that the near cache of the 'books' cache can hold before eviction occurs
ja_jp: 'books' キャッシュのエビクションが発生するまでにニアキャッシュが保持できる最大エントリ数を設定します

source: Sets the name of the bundle
ja_jp: バンドル名を設定

source: Sets the number of entity types to be indexed in parallel.
ja_jp: インデックスを並列に作成するエンティティータイプの数を設定します。

source: Sets the number of threads to be used to load the root entities.
ja_jp: ルートエンティティーをロードするために使用されるスレッドの数の設定。

source: Setting 'quarkus.oidc-client.auth-server-url' and 'quarkus.oidc-client.discovery-enabled' is not required in this case.
ja_jp: この場合、'quarkus.oidc-client.auth-server-url' および 'quarkus.oidc-client.discovery-enabled' の設定は必要ありません。

source: Setting Application Deployment
ja_jp: アプリケーションデプロイメントの設定

source: Setting DOCKER_HOST on Linux
ja_jp: Linux での DOCKER_HOST の設定

source: Setting Up
ja_jp: セットアップ

source: Setting `@ResourceProperties(authenticated=true)` which results in all methods of the resource requiring authentication
ja_jp: `@ResourceProperties(authenticated=true)` を設定することで、リソースのすべてのメソッドが認証を必要とするようになります。

source: Setting `INFO` as the minimum log level forces checks for lower levels, such as `isTraceEnabled()`, always to return `false`.
ja_jp: 最小ログレベルとして `INFO` を設定すると、 `isTraceEnabled()` などのより低いレベルのチェックが常に `false` を返すよう強制されます。

source: Setting `INFO` as the minimum logging level sets lower-level checks, such as `isTraceEnabled`, to `false`. This identifies code like `if(logger.isDebug()) callMethod();` that will never be executed and mark it as "dead."
ja_jp: `INFO` を最小ロギング・レベルとして設定すると、 `isTraceEnabled` のような低レベルのチェックが、 `false` に設定されます。 これにより、 `if(logger.isDebug()) callMethod();` のような実行されることのないコードが識別され、"dead "としてマークされます。

source: Setting `imagePullPolicy` to `IfNotPresent`
ja_jp: `imagePullPolicy` に `IfNotPresent` をセット

source: Setting `java.util.logging.manager` in the Maven Surefire plugin configuration:
ja_jp: Maven Surefire プラグインの設定で `java.util.logging.manager` を設定します。

source: Setting `quarkus.config-tracking.enabled` to `true` will enable a configuration interceptor that will record every configuration option that was read during the build process along with their values. The resulting report will be stored in `${project.basedir}/.quarkus/quarkus-prod-config-dump` by default. The target file could be configured using the following options:
ja_jp: `quarkus.config-tracking.enabled` を `true` に設定すると、設定インターセプターが有効になり、ビルドプロセス中に読み込まれたすべての設定オプションを、その値とともに記録します。結果のレポートはデフォルトで `${project.basedir}/.quarkus/quarkus-prod-config-dump` に保存されます。ターゲット・ファイルは以下のオプションで設定できます：

source: Setting `quarkus.datasource."pg".active=true` xref:config-reference.adoc#configuration-sources[at runtime] will make only the PostgreSQL datasource available, and setting `quarkus.datasource."oracle".active=true` at runtime will make only the Oracle datasource available.
ja_jp: xref:config-reference.adoc#configuration-sources[実行時に] `quarkus.datasource."pg".active=true` を設定すると PostgreSQLデータソースだけが利用可能になり、 実行時に `quarkus.datasource."oracle".active=true` を設定すると Oracleデータソースだけが利用可能になります。

source: Setting `quarkus.datasource."pg".active=true` xref:config-reference.adoc#configuration-sources[at runtime] makes only the PostgreSQL datasource available. Setting `quarkus.datasource."oracle".active=true` at runtime makes only the Oracle datasource available.
ja_jp: xref:config-reference.adoc#configuration-sources[実行時] に `quarkus.datasource."pg".active=true` を設定すると、PostgreSQL データソースのみが使用可能になります。 実行時に `quarkus.datasource."oracle".active=true` を設定すると、Oracle データソースのみが使用可能になります。

source: Setting `quarkus.http.ssl.client-auth` to `required` makes the server demand client certificates. You can set it to `REQUEST` if the server should accept requests without a certificate. This setting is useful when supporting multiple authentication methods besides mTLS.
ja_jp: `quarkus.http.ssl.client-auth` を `required` に設定すると、サーバーがクライアント証明書を要求します。サーバーが証明書なしでリクエストを受け入れる必要がある場合は、これを `REQUEST` に設定できます。この設定は、mTLS 以外の複数の認証方法をサポートする場合に便利です。

source: Setting `quarkus.mongodb.one.active=true` xref:config-reference.adoc#configuration-sources[at runtime] makes only the Mongo Client `one` available. Setting `quarkus.mongodb.two.active=true` at runtime makes only the Mongo Client `two` available.
ja_jp: `quarkus.mongodb.one.active=true` を xref:config-reference.adoc#configuration-sources[実行時に]設定すると、Mongo クライアント `one` のみが利用可能になります。実行時に `quarkus.mongodb.two.active=true` を設定すると、Mongo クライアント `two` のみが利用可能になります。

source: Setting `quarkus.native.compression.container-image` results in the compression to run in a container. If you want to set the variable, but not run the compression in a container, set `quarkus.native.compression.container-build` explicitly to `false`.
ja_jp: `quarkus.native.compression.container-image` を設定すると、圧縮がコンテナー内で実行されます。変数を設定しつつコンテナー内で圧縮を実行したくない場合は、 `quarkus.native.compression.container-build` を明示的に `false` に設定してください。

source: Setting `quarkus.oidc-client.auth-server-url` and `quarkus.oidc-client.discovery-enabled` is not required in this case.
ja_jp: この場合、 `quarkus.oidc-client.auth-server-url` と `quarkus.oidc-client.discovery-enabled` の設定は必要ありません。

source: Setting `quarkus.oidc.credentials.secret` is most likely required for Keycloak and other providers for the authorization code flow initiated from Dev UI to complete unless the client identified with `quarkus.oidc.client-id` is configured as a public client in your OpenID Connect provider's administration console.
ja_jp: `quarkus.oidc.client-id` で識別されるクライアントが OpenID Connect プロバイダーの管理コンソールで public クライアントとして設定されていない限り、Dev UI から開始された認可コードフローを完了するには、おそらく Keycloak やその他のプロバイダーで `quarkus.oidc.credentials.secret` を設定する必要があります。

source: Setting `quarkus.oidc.credentials.secret` will mostly likely be required for Keycloak and other providers for the authorization code flow initiated from Dev UI to complete, unless the client identified with `quarkus.oidc.client-id` is configured as a public client in your OpenID Connect provider's administration console.
ja_jp: Keycloak や その他のプロバイダーでは、 `quarkus.oidc.client-id` で指定されたクライアントが使用している OpenID Connect プロバイダーの管理コンソールでパブリッククライアントとして設定されていない限り、Dev UI から開始された認可コードフローを完了するには `quarkus.oidc.credentials.secret` の設定が必要です。

source: Setting `quarkus.oidc.resource-metadata.resource` to a relative value impacts the protected resource metadata route's address. For example, setting `quarkus.oidc.resource-metadata.resource=resource` for a default OIDC tenant makes its protected resource metadata route available at `/.well-known/oauth-protected-resource/resource`.
ja_jp: `quarkus.oidc.resource-metadata.resource` を相対値に設定すると、保護されたリソースメタデータルートのアドレスに影響します。たとえば、デフォルトの OIDC テナントに対して `quarkus.oidc.resource-metadata.resource=resource` と設定すると、その保護されたリソースメタデータルートは `/.well-known/oauth-protected-resource/resource` で利用可能になります。

source: Setting `quarkus.package.jar.aot.enabled=true` is all it takes. Quarkus automatically switches to the `aot-jar` packaging and sets up the entire AOT pipeline.
ja_jp: `quarkus.package.jar.aot.enabled=true` を設定するだけで十分です。Quarkus は自動的に `aot-jar` パッケージングに切り替わり、AOT パイプライン全体を設定します。

source: Setting `quarkus.package.write-transformed-bytecode-to-build-output=true` should be done with a caution and only if subsequent builds are done in a clean environment - i.e. the build tool's output directory has been completely cleaned.
ja_jp: `quarkus.package.write-transformed-bytecode-to-build-output=true` の設定は慎重に行い、その後のビルドがクリーンな環境で行われる場合、つまりビルドツールの出力ディレクトリが完全にクリーンになっている場合にのみ行う必要があります。

source: Setting `quarkus.package.write-transformed-bytecode-to-build-output=true` should be done with caution and only if subsequent builds are done in a clean environment - i.e. the build tool's output directory has been completely cleaned.
ja_jp: `quarkus.package.write-transformed-bytecode-to-build-output=true` は慎重に設定を行う必要があります。 後続のビルドがクリーンな環境で行われる場合、つまりビルドツールの出力ディレクトリが完全にクリーンである場合のみ行う必要があります。

source: Setting `quarkus.profile` to `staging` will activate the `staging` profile.
ja_jp: `quarkus.profile` を `staging` に設定すると、 `staging` プロファイルがアクティブになります。

source: Setting `quarkus.redis.one.active=true` xref:config-reference.adoc#configuration-sources[at runtime] makes only the Redis Client `one` available. Setting `quarkus.redis.two.active=true` at runtime makes only the Redis Client `two` available.
ja_jp: xref:config-reference.adoc#configuration-sources[実行時に] `quarkus.redis.one.active=true` を設定すると、 Redis クライアント `one` のみが利用可能になります。 実行時に `quarkus.redis.two.active=true` を設定すると、 Redis クライアント `two` のみが利用可能になります。

source: Setting `set scheduler-locking step` when the Quarkus native executable is running through `gdb` makes it easier to debug multi-threaded applications. It optimizes for single-stepping by stopping other threads from "seizing the prompt" by preempting the current thread is being stepped through.
ja_jp: Quarkusのネイティブ実行可能ファイルが `gdb` を介して実行されているときに `set scheduler-locking step` を設定すると、マルチスレッドアプリケーションのデバッグが容易になります。これは、現在のスレッドがステップスルーされるのを先取りして、他のスレッドが「プロンプトをつかむ」のを阻止することにより、シングルステッピングを最適化します。

source: Setting `tls` to `false` ensure we connect using a plain connection and then upgrade to a secure connection using `STARTTLS`.
ja_jp: `tls` を `false` に設定すると、プレーン接続を使用して接続し、その後 `STARTTLS` を使用してセキュアな接続にアップグレードされます。

source: Setting a log level below `DEBUG` requires the minimum log level to be adjusted, either globally via the `quarkus.log.min-level` property or per-category as shown in the example above, as well as adjusting the log level itself.
ja_jp: ログレベルを `DEBUG` より下に設定するには、ログレベル自体を調整するだけでなく、グローバルに `quarkus.log.min-level` プロパティーを介して、または上記の例のようにカテゴリごとに、最小ログレベルを調整する必要があります。

source: Setting coverage thresholds
ja_jp: カバレッジの閾値を設定

source: Setting it up
ja_jp: 設定

source: Setting other response properties
ja_jp: 他のレスポンスプロパティーの設定

source: Setting the `DOCKER_HOST` environment variable must be done every time or added to the profile:
ja_jp: 環境変数 `DOCKER_HOST` の設定は、毎回行うか、プロファイルに追加する必要があります。

source: Setting the `java.util.logging.manager` system property in the Maven Surefire plugin configuration
ja_jp: Maven Surefireプラグイン設定での `java.util.logging.manager` システムプロパティの設定

source: Setting the `java.util.logging.manager` system property in the Maven Surefire plugin configuration:
ja_jp: Maven Surefire プラグイン構成で `java.util.logging.manager` システム・プロパティを設定します：

source: Setting the `parameters` flag this way works around https://issues.apache.org/jira/browse/MCOMPILER-413[MCOMPILER-413].
ja_jp: この方法で `parameters` フラグを設定すると、 link:https://issues.apache.org/jira/browse/MCOMPILER-413[MCOMPILER-413] を回避できます。

source: Setting the `quarkus.messaging.health.enabled` configuration property to `false` completely disables the messaging health checks.
ja_jp: `quarkus.messaging.health.enabled` 設定プロパティーを `false` に設定すると、メッセージングのヘルスチェックが完全に無効になります。

source: Setting the `quarkus.oidc.client-id` property is encouraged even if the endpoint does not require access to the remote introspection endpoint. This is because when `client-id` is set, it can be used to verify the token audience. It will also be included in logs when the token verification fails, enabling better traceability of tokens issued to specific clients and analysis over a longer period.
ja_jp: エンドポイントがリモートイントロスペクションエンドポイントへのアクセスを必要としない場合でも、 `quarkus.oidc.client-id` プロパティーを設定することを推奨します。 これは、 `client-id` が設定されている場合、それを使用してトークンオーディエンスを検証できるためです。 また、トークンの検証が失敗した場合にも client-id がログに含まれるため、特定のクライアントに発行されたトークンのトレーサビリティーが向上し、より長い期間にわたる分析が可能になります。

source: Setting the base URL of the client is **mandatory**, however the REST Client supports per-invocation overrides of the base URL using the `@io.quarkus.rest.client.reactive.Url` annotation.
ja_jp: クライアントのベース URL の設定は **必須** ですが、REST Client は `@io.quarkus.rest.client.reactive.Url` アノテーションを使用して、呼び出しごとにベース URL をオーバーライドすることをサポートしています。

source: Setting the consumer rebalance listener’s name takes precedence over using the group id.
ja_jp: コンシューマーリバランスリスナーの名前の設定は、グループ ID の使用よりも優先されます。

source: Setting the log level
ja_jp: ログレベルの設定

source: Setting the password
ja_jp: パスワードの設定

source: Setting the port
ja_jp: ポートの設定

source: Setting the properties would occur in the normal manner:
ja_jp: プロパティの設定は通常の方法で行います。

source: Setting the property to `warn-each` logs a warning for *each* offending transaction.
ja_jp: プロパティを `warn-each` に設定すると、問題のあるトランザクション *ごとに* 警告がログに記録されます。

source: Setting the property to `warn-each` results in logging a warning on *each* offending transaction.
ja_jp: プロパティーを `warn-each` に設定すると、問題のある *各* トランザクションで警告が記録されます。

source: Setting the property to `warn-first` logs a warning for the *first* offending transaction.
ja_jp: このプロパティを `warn-first` に設定すると、 *最初の* 違反トランザクションに対して警告がログに記録されます。

source: Setting the property to `warn-first` results in logging a warning on the *first* offending transaction.
ja_jp: プロパティーを `warn-first` に設定すると、問題のある *最初* のトランザクションで警告が記録されます。

source: Setting this property applies reflection-free optimization to deserialization and serialization.
ja_jp: このプロパティを設定すると、デシリアライズとシリアライズにリフレクションフリーの最適化が適用されます。

source: Setting up JaCoCo
ja_jp: Jacocoの設定

source: Setting up Jacoco
ja_jp: Jacocoのセットアップ

source: Setting up Knative
ja_jp: Knative の設定

source: Setting up Knative locally in a Minikube environment is beyond the scope of this guide. It is advised to follow https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/index.html[this] Knative Tutorial put together by Red Hat. It walks through how to set up Knative on Minikube or OpenShift in a local environment.
ja_jp: Minikube 環境で Knative をローカルに設定することは、このガイドの範囲を超えています。link:https://redhat-developer-demos.github.io/knative-tutorial/knative-tutorial/index.html[Red HatがまとめたKnativeチュートリアル] に従うことをお勧めします。このチュートリアルでは、ローカル環境でMinikubeやOpenShift上でKnativeをセットアップする方法を説明しています。

source: Setting up REST Data with Panache
ja_jp: REST Data with Panacheのセットアップ

source: Setting up a mock HTTP server, against which tests are run, is a common testing pattern. Examples of such servers are link:http://wiremock.org/[Wiremock] and link:https://docs.hoverfly.io/projects/hoverfly-java/en/latest/index.html[Hoverfly]. In this section we'll demonstrate how Wiremock can be leveraged for testing the `ExtensionsService` which was developed above.
ja_jp: テストを実行するためのモックHTTPサーバーを設定することは、一般的なテストパターンです。そのようなサーバーの例としては、 link:http://wiremock.org/[Wiremock] や link:https://docs.hoverfly.io/projects/hoverfly-java/en/latest/index.html[Hoverfly] があります。このセクションでは、上で開発した `ExtensionsService` をテストするために Wiremock をどのように活用できるかを示します。

source: Setting up a mock HTTP server, against which tests are run, is a common testing pattern. Examples of such servers are link:https://wiremock.org/[Wiremock] and link:https://docs.hoverfly.io/projects/hoverfly-java/en/latest/index.html[Hoverfly]. In this section we'll demonstrate how Wiremock can be leveraged for testing the `ExtensionsService` which was developed above.
ja_jp: テストを実行する際にモック HTTP サーバーを設定することは、一般的なテストパターンです。 そのようなサーバーの例としては、link:http://wiremock.org/[Wiremock] や link:https://docs.hoverfly.io/projects/hoverfly-java/en/latest/index.html[Hoverfly] があります。 このセクションでは、ここまでで開発した `ExtensionsService` をテストするために Wiremock を活用する方法を示します。

source: Setting up an interactive application
ja_jp: インタラクティブ・アプリケーションの設定

source: Setting up and configuring Blaze-Persistence
ja_jp: Blaze-Persistenceのセットアップと設定

source: Setting up and configuring Hibernate ORM
ja_jp: Hibernate ORMのセットアップと設定

source: Setting up and configuring Hibernate ORM with Panache
ja_jp: PanacheによるHibernate ORMのセットアップと設定

source: Setting up and configuring Hibernate ORM with Panache and Kotlin
ja_jp: Hibernate ORM with PanacheとKotlinのセットアップと設定

source: Setting up and configuring Hibernate ORM with a `persistence.xml`
ja_jp: `persistence.xml` を使用した場合のHibernate ORMのセットアップと設定

source: Setting up and configuring Hibernate Reactive
ja_jp: Hibernate Reactiveのセットアップと設定
